# Створюємо привітання з користувачем
print("Ласкаво просимо до гри MadLibs!")

# Просимо у користувача слова:
print("Введіть слова які будуть вказані дальше")
imenik = input("Ведіть любий іменник: ")
color = input("Ведіть любий колір: ")
dieslovo = input("Ведіть любе дієслово: ")
animal = input("Ведіть любу назву тварини: ")
misce = input("Ведіть любу назву місця: ")

# Видаємо текст
print(f"  Одного разу {imenik} був дуже сумний, тому що він був {color}. "
      f"Він вирішив {dieslovo} у {misce}, де зустрів {animal}. "
      f"Разом вони вирішили залишитися в {misce} назавжди, і стали найкращими друзями.")
     
