score = 0

print("Вітаю в грі quiz game!")


category = int(input("Оберіть категорію: 1 - ПК, 2 - космоc, 3 - історія: "))

if category == 1:
    print("Ви обрали категорію ПК")
    
    question_a1 = input("Питання №1: \n     Яка компанія створила операційну систему Windows? \n      A) Apple \n     B) Google \n     C) Microsoft \n    Відповідь: ")
    if question_a1 == "С":
            print("Відповідь правильна!")
            score += 1
    else:
        print("Відповідь неправильна!") 
    
    question_a2 = input("Питання №2: \n     Яка компанія створила операційну систему MacOS? \n      A) Apple \n     B) Microsoft \n     C) Google \n    Відповідь: ")
    if question_a2 == "A":
        print("Відповідь правильна!")
        score += 1
    else:
        print("Відповідь неправильна!")
    
    question_a3 = input("Питання №2: \n     Яка компанія випускає відеокарти серії RTX? \n    A) AMD \n    B) Nvidia \n    C) Intel \n  Відповідь: ") 
    if question_a3 == "B":
        print("Відповідь правильна!")
        score += 1
    else:
        print("Відповідь неправильна!")
    
    question_a4 = input("Питання №3: \n     Що відповідає за обробку графіки в ПК? \n    Відповідь: ")
    if question_a4 == "Відеокарта":
        print("Відповідь правильна!")
        score += 1
    else:
        print("Відповідь неправильна!")
    
    question_a5 = input("Питання №4: \n     Що відповідає за обробку даних в ПК? \n   Відповідь: ")
    if question_a5 == "Процесор":
        print("Відповідь правильна!")
        score += 1
    else:
        print("Відповідь неправильна!")

    print(f"Ви відповіли правильно на {score} з 5 питань")

elif category == 2:
    print("Ви обрали категорію космос")
    
    question_b1 = input("Питання №1: \n     Яка планета найбільша в Сонячній системі? \n    A) Земля \n    B) Юпітер \n    C) Сонце \n    Відповідь: ")
    if question_b1 == "B":
        print("Відповідь правильна!")
        score += 1
    else:
        print("Відповідь неправильна!")

    question_b2 = input("Питання №2: \n     Яка планета найближча до Сонця? \n    A) Меркурій \n    B) Венера \n    C) Земля \n    Відповідь: ")
    if question_b2 == "A":
        print("Відповідь правильна!")
        score += 1
    else:
        print("Відповідь неправильна!")    

    question_b3 = input("Питання №3: \n     Яка планета найменша в Сонячній системі? \n    A) Марс \n    B) Меркурій \n    C) Земля \n    Відповідь: ")
    if question_b3 == "B":
        print("Відповідь правильна!")
        score += 1
    else:
        print("Відповідь неправильна!")

    question_b4 = input("Питання №4: \n   На якій планеті ми живемо? \n    Відповідь: ")
    if question_b4 == "Земля":
        print("Відповідь правильна!")
        score += 1
    else:
        print("Відповідь неправильна!")
    question_b5 = input("Питання №5: \n    Яка найблища сонячна система до нашої? \n    Відповідь: ")
    if question_b5 == "Альфа Центавра":
        print("Відповідь правильна!")
        score += 1
    else:
        print("Відповідь неправильна!")
    
    print(f"Ви відповіли правильно на {score} з 5 питань") 

elif category == 3: 
    print("Ви обрали категорію історія")

    question_c1 = input("Питання №1: \n     Коли почалась перша світова війна? \n   Відповідь: ")   
    if question_c1 == "1914":
        print("Відповідь правильна!")
        score += 1
    else:
        print("Відповідь неправильна!")

    question_c2 = input("Питання №2: \n     Коли почалась друга світова війна? \n   Відповідь: ")    
    if question_c2 == "1939":
        print("Відповідь правильна!")
        score += 1
    else:
        print("Відповідь неправильна!")
    
    question_c3 = input("Питання №3: \n     Коли розпався ссср  \n   Відповідь: ")
    if question_c3 == "1991":
        print("Відповідь правильна!")
        score += 1
    else:
        print("Відповідь неправильна!")

    question_c4 = input("Питання №4: \n     Яка держава виграла першу світову війну? \n   A) Німеччина \n   B) США \n   C) Росія \n   Відповідь: ")
    if question_c4 == "B":
        print("Відповідь правильна!")
        score += 1
    else:
        print("Відповідь неправильна!")
    question_5 = input("Питання №5: \n     Яка держава виграла другу світову війну? \n   A) США \n   B) Росія \n   C) Німеччина \n   Відповідь: ")
    if question_5 == "A":
        print("Відповідь правильна!")
        score += 1
    else:
        print("Відповідь неправильна!")
    print(f"Ви відповіли правильно на {score} з 5 питань")
else:
    print("Неправильно вибрана категорія")
    print("Спробуйте ще раз")
    